configuration/src/InformationRegisters/ОчередьЗаявокНаОповещениеПользователей/ОчередьЗаявокНаОповещениеПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗаявокНаОповещениеПользователей</name>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НастройкиУведомленийПользователей/НастройкиУведомленийПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУведомленийПользователей</name>
  <dimensions>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидУведомления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаЗаказчиков</name>
    <type>
      <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьОтправкиЭлектронныхПисем/ОчередьОтправкиЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОтправкиЭлектронныхПисем</name>
  <resources>
    <name>Адрес</name>
    <comment>Адрес электронной почты получателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПодготовленныеСообщенияПользователяПоКатегориям/ПодготовленныеСообщенияПользователяПоКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодготовленныеСообщенияПользователяПоКатегориям</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКомментария</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСообщения</name>
    <type>
      <types>EnumRef.КатегорииСообщенийПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.ПолучательОповещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОповещения</name>
    <type>
      <types>EnumRef.ТипыОповещенийПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальности</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидУведомления/ВидУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидУведомления</name>
  <enumValues>
    <name>ПубликацияЗадач</name>
  </enumValues>
  <enumValues>
    <name>СозданиеЗаявок</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/КатегорииСообщенийПользователя/КатегорииСообщенийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСообщенийПользователя</name>
  <enumValues>
    <name>АвтоматическоеЗакрытиеЗадач</name>
  </enumValues>
  <enumValues>
    <name>ВажныеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеЗадачиВПул</name>
  </enumValues>
  <enumValues>
    <name>ДоступКОбъекту</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеДатВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЗнанийИВопросов</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНаправленияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеОписанияИлиНазванияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПользователейВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОбъекта</name>
  </enumValues>
  <enumValues>
    <name>Комментарии</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеОНаличииСтопСлов</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>СозданиеОбъектов</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/ОчередьЗаявокНаОповещениеПользователей/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура Добавить(Знач Заявка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Заявка) ИЛИ ТипЗнч(Заявка) <> Тип("ДокументСсылка.ЗаявкаНаРазработку") Тогда
		ВызватьИсключение "Некорректное значение параметра ""Заявка"".";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОчередьЗаявокНаОповещениеПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Заявка = Заявка;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет из регистра сведений одну запись по переданной заявке.
//
// Параметры:
//  Заявки - Массив - массив заявок, запись по которым необходимо удалить.
//
Процедура УдалитьВсеЗаписи() Экспорт
	
	НаборЗаписей = РегистрыСведений.ОчередьЗаявокНаОповещениеПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПодготовитьОповещенияПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОчередьЗаявокНаОповещениеПользователей.Заявка КАК Заявка,
	|	ЗаявкаНаРазработку.Направление КАК Направление,
	|	ЗаявкаНаРазработку.Автор КАК Автор,
	|	ЗаявкаНаРазработкуСистемыРазработки.Система КАК Система,
	|	ЗаявкаНаРазработкуСистемыРазработки.ГруппаЗаказчиков КАК ГруппаЗаказчиков,
	|	ЗаявкаНаРазработку.Дата КАК Дата,
	|	СистемыУчета.Руководитель КАК РуководительСистемы
	|ПОМЕСТИТЬ НаправлениеСистемаАвторЗаявки
	|ИЗ
	|	РегистрСведений.ОчередьЗаявокНаОповещениеПользователей КАК ОчередьЗаявокНаОповещениеПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку.СистемыРазработки КАК ЗаявкаНаРазработкуСистемыРазработки
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СистемыУчета КАК СистемыУчета
	|				ПО ЗаявкаНаРазработкуСистемыРазработки.Система = СистемыУчета.Ссылка
	|			ПО ЗаявкаНаРазработку.Ссылка = ЗаявкаНаРазработкуСистемыРазработки.Ссылка
	|		ПО ОчередьЗаявокНаОповещениеПользователей.Заявка = ЗаявкаНаРазработку.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаправлениеСистемаАвторЗаявки.Заявка КАК Заявка,
	|	ПРЕДСТАВЛЕНИЕ(НаправлениеСистемаАвторЗаявки.Заявка) КАК ЗаявкаПредставление,
	|	НастройкиУведомленийПользователей.Пользователь КАК Пользователь,
	|	ПРЕДСТАВЛЕНИЕ(НаправлениеСистемаАвторЗаявки.Автор) КАК Автор,
	|	НаправлениеСистемаАвторЗаявки.Дата КАК Дата
	|ИЗ
	|	НаправлениеСистемаАвторЗаявки КАК НаправлениеСистемаАвторЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУведомленийПользователей КАК НастройкиУведомленийПользователей
	|		ПО (НастройкиУведомленийПользователей.ВидУведомления = &ВидУведомления)
	|			И НаправлениеСистемаАвторЗаявки.Направление = НастройкиУведомленийПользователей.Направление
	|			И НаправлениеСистемаАвторЗаявки.Система = НастройкиУведомленийПользователей.Система
	|			И НаправлениеСистемаАвторЗаявки.ГруппаЗаказчиков = НастройкиУведомленийПользователей.ГруппаЗаказчиков
	|			И НаправлениеСистемаАвторЗаявки.Автор <> НастройкиУведомленийПользователей.Пользователь
	|ИТОГИ
	|	МАКСИМУМ(Автор),
	|	МАКСИМУМ(Дата)
	|ПО
	|	Заявка,
	|	Пользователь";
	
	Запрос.УстановитьПараметр("ВидУведомления", Перечисления.ВидУведомления.СозданиеЗаявок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаявок = Новый Массив;
	
	ВыборкаЗаявок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаявок.Следующий() Цикл
		МассивЗаявок.Добавить(ВыборкаЗаявок.Заявка);
		МассивПользователей = Новый Массив;
		
		ВыборкаПользователей = ВыборкаЗаявок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПользователей.Следующий() Цикл
			МассивПользователей.Добавить(ВыборкаПользователей.Пользователь);
		КонецЦикла;
		
		ШаблоныПисьма = РегистрыСведений.ОчередьОтправкиЭлектронныхПисем.ШаблоныЭлектронногоПисьма();
		
		ТекстСообщения = ШаблоныПисьма.БлокОсновногоТекста;
		
		ТекстШаблона = СтрЗаменить(ШаблоныПисьма.ЗаголовокСобытия, "<!-- event_date -->", Формат(ВыборкаЗаявок.Дата, ШаблоныПисьма.ФорматДаты));
		ТекстШаблона = СтрЗаменить(ТекстШаблона, "<!-- user_name -->", ВыборкаЗаявок.Автор);
		ТекстШаблона = СтрЗаменить(ТекстШаблона, "<!-- event -->", "создал(-а) объект.");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "<!-- content -->", ТекстШаблона);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "<!-- font_size -->", "14px");
		
		СообщениеSDMS = " создал(-а) объект.";
		
		СообщениеПользователям = Новый Структура("ТекстСообщения, КатегорияСообщения, Период, СообщениеSDMS",
			ТекстСообщения, Перечисления.КатегорииСообщенийПользователя.СозданиеОбъектов, ВыборкаЗаявок.Дата, СообщениеSDMS);
		
		РегистрыСведений.ПодготовленныеСообщенияПользователяПоКатегориям.Добавить(МассивПользователей,
			ВыборкаЗаявок.Заявка, СообщениеПользователям, ВыборкаЗаявок.Автор);
	КонецЦикла;
	
	УдалитьВсеЗаписи();
	
КонецПроцедуры

#КонецОбласти
